# coding: utf-8

def get_cate():
    cate_list = [
        '服饰内衣', '运动户外', '女装', '内衣', '男装', '运动户外服装', '运动户外鞋包', '运动健身器材', '日用百货', '食品饮料', '工艺品、礼品', '宠物及园艺',
        '眼镜及配件', '食品', '饮料', '母婴', '玩具', '童装', '母婴用品', '鞋包', '配饰', '鞋靴', '箱包', '美妆', '日化', '美容护肤市场', '身体护理市场',
        '家清纸品/女性护理市场', '彩妆/化妆工具市场', '美发造型市场', '家庭清洁市场', '数码家电', '汽车用品', '数码/电脑', '家用电器', '机械', '五金', '仪表', '机械及行业设备', '五金/工具/机床', '包装', '办公文教',
        '物流包装/辅材市场', '塑料包装市场', '纸包装/布包装/其他包装市场', '电工', '安防', '电工、电气市场', '个人防护市场', '消防/监控市场', '照明', '电子', 'LED灯配城', '家装建材', '家纺家饰',
        '五金主材', '家具灯具', '橡塑', '化工', '冶金矿产', '精细化学品', '能源', '钢铁', '热轧板卷', '冷轧涂镀类', '不锈钢类', '建材型材', '管材', '中厚板及其他',
    ]
    return cate_list

