# coding=utf-8
import requests
import json
import os

def get_headers():
    headers = {
        'x-mac': '74:ac:5f:ca:d6:47',
        'x-system-plateform': 'android',
        'x-network': 'wifi',
        'x-version': '1.2.0',
        'x-terminal-type': '360',
        'x-correlation-id': 'e42a2260dd53328a',
        'x-crfs-token': 'r4CJC1ODl/3eYOGBUhxrXe6wAK/+GIfN9FNID/ICdrt9dAIekzdrfj+uCu22vedT_fJiRrWL7uQ4aNuq+00hhSQ==',
        'Content-Type': 'application/json; charset=utf-8',
        'Content-Length': '123',
        'Host': 'api.roseparkapp.com',
        'Connection': 'Keep-Alive',
        'Accept-Encoding': 'gzip',
        'User-Agent': 'okhttp/3.14.4',
    }
    return headers

def get_id_list():
    cities = ['石家庄市', '张家口市', '承德市', '唐山市', '秦皇岛市', '廊坊市', '保定市', '沧州市', '衡水市', '邢台市', '邯郸市', '太原市', '大同市', '朔州市',
              '忻州市', '阳泉市', '晋中市', '吕梁市', '长治市', '临汾市', '晋城市', '运城市', '呼和浩特市', '包头市', '乌海市', '赤峰市', '呼伦贝尔市', '兴安盟市',
              '通辽市', '锡林郭勒盟市', '乌兰察布盟市', '伊克昭盟市', '巴彦淖尔盟市', '阿拉善盟市', '哈尔滨市', '黑河市', '伊春市', '齐齐哈尔市', '鹤岗市', '佳木斯市',
              '双鸭山市', '绥化市', '大庆市', '七台河市', '鸡西市', '牡丹江市', '大兴安岭地区', '长春市', '白城市', '松原市', '吉林市', '四平市', '辽源市', '白山市',
              '通化市', '延边朝鲜族自治州', '沈阳市', '铁岭市', '阜新市', '抚顺市', '朝阳市', '本溪市', '辽阳市', '鞍山市', '盘锦市', '锦州市', '葫芦岛市', '营口市',
              '丹东市', '大连市', '南京市', '连云港市', '徐州市', '宿迁市', '淮安市', '盐城市', '泰州市', '扬州市', '镇江市', '南通市', '常州市', '无锡市', '苏州市',
              '杭州市', '湖州市', '嘉兴市', '绍兴市', '舟山市', '宁波市', '金华市', '衢州市', '台州市', '丽水市', '温州市', '合肥市', '淮北市', '亳州市', '宿州市',
              '蚌埠市', '阜阳市', '淮南市', '滁州市', '六安市', '马鞍山市', '芜湖市', '宣城市', '铜陵市', '池州市', '安庆市', '黄山市', '福州市', '宁德市', '南平市',
              '三明市', '莆田市', '龙岩市', '泉州市', '漳州市', '厦门市', '南昌市', '九江市', '景德镇市', '上饶市', '鹰潭市', '抚州市', '新余市', '宜春市', '萍乡市',
              '吉安市', '赣州市', '济南市', '德州市', '滨州市', '东营市', '烟台市', '威海市', '淄博市', '潍坊市', '聊城市', '泰安市', '莱芜市', '青岛市', '日照市',
              '济宁市', '菏泽市', '临沂市', '枣庄市', '郑州市', '安阳市', '鹤壁市', '濮阳市', '新乡市', '焦作市', '三门峡市', '开封市', '洛阳市', '商丘市', '许昌市',
              '平顶山市', '周口市', '漯河市', '南阳市', '驻马店市', '信阳市', '武汉市', '十堰市', '襄樊市', '随州市', '荆门市', '孝感市', '宜昌市', '黄冈市', '鄂州市',
              '荆州市', '黄石市', '咸宁市', '恩施土家族苗族自治州', '神农架地区', '长沙市', '岳阳市', '张家界市', '常德市', '益阳市', '湘潭市', '株洲市', '娄底市',
              '怀化市', '邵阳市', '衡阳市', '永州市', '郴州市', '湘西土家族苗族自治州', '广州市', '韶关市', '梅州市', '河源市', '清远市', '潮州市', '揭阳市', '汕头市',
              '肇庆市', '惠州市', '佛山市', '东莞市', '云浮市', '汕尾市', '江门市', '中山市', '深圳市', '珠海市', '阳江市', '茂名市', '湛江市', '南宁市', '桂林市',
              '河池市', '贺州市', '柳州市', '百色市', '来宾市', '梧州市', '贵港市', '玉林市', '崇左市', '钦州市', '防城港市', '北海市', '海口市', '三亚市', '三沙市',
              '儋州市', '五指山市', '文昌市', '琼海市', '万宁市', '东方市，定安县', '屯昌县', '澄迈县', '临高县', '白沙黎族自治县', '昌江黎族自治县', '乐东黎族自治县',
              '陵水黎族自治县', '保亭黎族苗族自治县', '琼中黎族苗族自治县', '成都市', '广元市', '巴中市', '绵阳市', '德阳市', '达州市', '南充市', '遂宁市', '广安市', '资阳市',
              '眉山市', '雅安市', '内江市', '乐山市', '自贡市', '泸州市', '宜宾市', '攀枝花市', '阿坝藏族羌族自治州', '甘孜藏族自治州', '凉山彝族自治州', '贵阳市', '遵义市',
              '六盘水市', '安顺市', '铜仁市', '毕节市', '黔西南布依族苗族自治州', '黔东南苗族侗族自治州', '黔南布依族苗族自治州', '昆明市', '昭通市', '丽江市', '曲靖市', '保山市',
              '玉溪市', '临沧市', '普洱市', '德宏傣族景颇族自治州', '怒江僳僳族自治州', '楚雄彝族自治州', '红河哈尼族彝族自治州', '文山壮族苗族自治州', '西双版纳傣族自治州',
              '大理白族自治州', '迪庆藏族自治州', '拉萨市', '日喀则地区', '昌都地区', '林芝地区', '山南地区', '那曲地区', '阿里地区', '西安市', '榆林市', '延安市', '铜川市',
              '渭南市', '宝鸡市', '咸阳市', '商洛市', '汉中市', '安康市', '兰州市', '嘉峪关市', '酒泉市', '张掖市', '金昌市', '武威市', '白银市', '庆阳市', '平凉市',
              '定西市', '天水市', '陇南市', '临夏回族自治州', '甘南藏族自治州', '西宁市', '海东地区', '海北藏族自治州', '海南藏族自治州', '黄南藏族自治州', '果洛藏族自治州',
              '玉树藏族自治州', '海西蒙古族藏族自治州', '银川市', '石嘴山市', '吴忠市', '中卫市', '固原市', '乌鲁木齐市', '克拉玛依市', '吐鲁番地区', '哈密地区', '和田地区',
              '阿克苏地区', '喀什地区', '克孜勒苏柯尔克孜自治州', '巴音郭楞蒙古自治州', '昌吉回族自治州', '博尔塔拉蒙古自治州', '石河子市', '阿拉尔市', '图木舒克市', '五家渠市',
              '伊犁哈萨克自治州', '台北市', '高雄市', '基隆市', '新竹市', '台中市', '嘉义市', '台南市', '台北县', '桃园县', '新竹县', '苗栗县', '台中县', '彰化县',
              '南投县', '云林县', '嘉义县', '台南县', '高雄县', '屏东县', '宜兰县', '花莲县', '台东县', '澎湖县', '澳门市', '香港市', '其他市','北京市','上海市','天津市','重庆市']
    # cities = ['石家庄市', '成都市', '张家口市', '承德市', '唐山市', '秦皇岛市', '廊坊市', '保定市', '沧州市', '衡水市', '邢台市', '邯郸市', '太原市', '大同市', '朔州市', '吕梁市', '临汾市', '运城市', '呼和浩特市', '包头市', '通辽市', '哈尔滨市', '黑河市', '齐齐哈尔市', '绥化市', '大庆市', '牡丹江市', '长春市', '吉林市', '通化市', '延边朝鲜族自治州', '沈阳市', '朝阳市', '盘锦市', '大连市', '南京市', '连云港市', '徐州市', '宿迁市', '淮安市', '盐城市', '泰州市', '扬州市', '镇江市', '南通市', '常州市', '无锡市', '苏州市', '杭州市', '湖州市', '嘉兴市', '绍兴市', '宁波市', '金华市', '台州市', '温州市', '合肥市', '淮北市', '宿州市', '阜阳市', '滁州市', '六安市', '马鞍山市', '芜湖市', '池州市', '福州市', '宁德市', '南平市', '泉州市', '漳州市', '厦门市', '南昌市', '九江市', '上饶市', '抚州市', '宜春市', '萍乡市', '吉安市', '赣州市', '济南市', '德州市', '东营市', '烟台市', '聊城市', '青岛市', '日照市', '菏泽市', '临沂市', '枣庄市', '郑州市', '鹤壁市', '濮阳市', '开封市', '洛阳市', '商丘市', '许昌市', '周口市', '漯河市', '南阳市', '驻马店市', '信阳市', '武汉市', '十堰市', '孝感市', '荆州市', '咸宁市', '恩施土家族苗族自治州', '长沙市', '常德市', '湘潭市', '株洲市', '娄底市', '怀化市', '衡阳市', '永州市', '郴州市', '广州市', '韶关市', '梅州市', '清远市', '潮州市', '揭阳市', '汕头市', '肇庆市', '惠州市', '佛山市', '东莞市', '汕尾市', '江门市', '中山市', '深圳市', '珠海市', '阳江市', '湛江市', '南宁市', '河池市', '梧州市', '贵港市', '玉林市', '崇左市', '海口市', '三亚市', '儋州市', '巴中市', '绵阳市', '德阳市', '达州市', '遂宁市', '广安市', '资阳市', '眉山市', '雅安市', '内江市', '乐山市', '自贡市', '泸州市', '宜宾市', '甘孜藏族自治州', '贵阳市', '遵义市', '安顺市', '铜仁市', '毕节市', '黔南布依族苗族自治州', '昆明市', '昭通市', '丽江市', '临沧市', '北京市', '上海市', '天津市', '重庆市', '西安市', '榆林市', '延安市', '咸阳市', '安康市', '兰州市', '武威市', '定西市', '陇南市', '西宁市', '海南藏族自治州', '银川市', '吴忠市', '中卫市', '乌鲁木齐市', '克拉玛依市']

    id_lists = []
    for city in cities:
        url = 'https://api.roseparkapp.com/query/nerby/user/news'
        datas = '{"latitude":30.64904,"longitude":104.083049,"nowZone":"%s","online":false,"page":1,"pageSize":20,"selectType":"","sex":"man"}'%city
        data = datas.encode('utf-8')
        res = json.loads(requests.post(url,headers=get_headers(),data=data).text)
        id_infos = res['data']['result']
        id_list = []
        for id_info in id_infos:
            id_list.append(id_info['uid'])
        id_lists.append(id_list)
    return id_lists

def get_detail_info():
    idss = get_id_list()
    for ids in idss:
        for id in ids:
            datas = '{"beViewUID":%s,"latitude":30.6491,"longitude":104.083021}'%id
            data = datas.encode('utf-8')
            url = 'https://api.roseparkapp.com/query/user/other/person/info'
            user_infos = json.loads(requests.post(url,headers=get_headers(),data=data).text)
            nickName = user_infos['data']['personInfo']['nickName']
            print(nickName)
            base_url = "https://file.roseparkapp.com"
            headImage_url = base_url + user_infos['data']['personInfo']['headImage']
            if os.path.isfile('%s'%nickName + '.jpg'):
                pass
            else:
                with open('%s'%nickName + '.jpg', 'wb') as f:
                    img = requests.get(headImage_url).content
                    f.write(img)
get_detail_info()
